anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/BoardBlePassiveScanner.cpp
    RawScanContext scanContext;
    scanContext.maximumRecords = plan.maximumRecords;
    scanContext.deduplicateAddresses = plan.deduplicateAddresses;
    scanContext.visitor = visitor;
    scanContext.visitorContext = context;
    scanContext.result = &result;
    const std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    for (std::uint16_t attempt = 1U;
         attempt <= kMaximumScanAttempts; ++attempt) {
        result.attempts = attempt;
        if (cancelRequested_.load(std::memory_order_acquire)) {
            result.status = BoardBleScanStatus::ScanTimedOut;
            break;
        }
        clearReportQueue();
        setAcceptingReports(true);
        const bool started = startPassiveScan(plan);
        if (!started) {
            setAcceptingReports(false);
            activeScan_ = false;
            result.status = BoardBleScanStatus::ScannerUnavailable;
        } else {
            activeScan_ = true;
            const std::uint64_t deadlineUs =
                static_cast<std::uint64_t>(esp_timer_get_time()) +
                static_cast<std::uint64_t>(plan.durationMs) * 1000ULL;
            while (activeScan_ &&
                   !cancelRequested_.load(std::memory_order_acquire) &&
                   static_cast<std::uint64_t>(esp_timer_get_time()) <
                       deadlineUs) {
                drainReports(&scanContext);
                vTaskDelay(pdMS_TO_TICKS(5U));
            }
            drainReports(&scanContext);
            const bool completedWindow = activeScan_;
            const bool disabled = completedWindow ? stopPassiveScan() : true;
            activeScan_ = false;
            setAcceptingReports(false);
            drainReports(&scanContext);
            result.status = completedWindow && disabled &&
                    !cancelRequested_.load(std::memory_order_acquire)
                ? BoardBleScanStatus::Valid
                : BoardBleScanStatus::ScanTimedOut;
        }
        if (result.valid() || attempt == kMaximumScanAttempts) break;
        if (result.status != BoardBleScanStatus::ScannerUnavailable &&
            result.status != BoardBleScanStatus::ScanTimedOut) {
            break;
        }
        increment(&result.transientRetries);
        vTaskDelay(pdMS_TO_TICKS(kRetryDelayMs));
    }
    result.durationUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - startedUs;
    return result;
}

bool BoardBlePassiveScanner::cancelActiveScan() {
    cancelRequested_.store(true, std::memory_order_release);
    if (!activeScan_) return true;
    const bool cancelled = stopPassiveScan();
    activeScan_ = false;
    setAcceptingReports(false);
    return cancelled;
}

bool BoardBlePassiveScanner::processControllerReady() {
    return processControllerAvailable && processNimbleSynced &&
        ble_hs_synced();
}

bool BoardBlePassiveScanner::end() {
    bool complete = cancelActiveScan();
    initialized_ = false;
    activeScan_ = false;
    complete = shutdownProcessControllerObserver() && complete;
    cleanupComplete_ = complete && !processControllerReady() &&
        !processNimbleHostRunning && !processControllerInitialized;
    beginDiagnostic_.cleanupComplete = cleanupComplete_;
    return cleanupComplete_;
}

}  // namespace leshy1::platform::arduino
